toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        Wait();
        Assert(_Enabled);
        Args = {srcBlock, dstBlockIdx};
        _Scheduler::Start<_SDTask>([] { _WriteImage(Args.srcBlock, Args.dstBlockIdx); });
    }
    
    static MSP::ImgRingBuf& ImgRingBuf() {
        // Wait until _State.sd has been initialized (as signified by _RCA existing)
        // before returning an element of _State.sd.
        _Scheduler::Wait([&] { return _RCA.has_value(); });
        return _State.sd.imgRingBufs[0];
    }
    
    static void Wait() {
        _Scheduler::Wait<_SDTask>();
    }
    
    static void _Enable() {
        Assert(!_Enabled);
        
        _SetPowerEnabled(true);
        if (!_RCA) {
            // We haven't successfully enabled the SD card since the battery was connected;
            // enable the SD card and get the card id / card data.
            SD::CardId cardId;
            SD::CardData cardData;
            _RCA = _SDCard::Init(&cardId, &cardData);
            
            // If SD state isn't valid, or the existing SD card id doesn't match the current
            // card id, reset the SD state.
            if (!_State.sd.valid || memcmp(&_State.sd.cardId, &cardId, sizeof(cardId))) {
                _StateInit(cardId, cardData);
            
            // Otherwise the SD state is valid and the SD card id matches, so init the ring buffers.
            } else {
                _ImgRingBufInit();
            }
        
        } else {
            // We've previously enabled the SD card successfully since the battery was connected;
            // enable it again
            _SDCard::Init();
        }
        
        _Enabled = true;
    }
    
    static void _Disable() {
        Assert(_Enabled);
        
        _SetPowerEnabled(false);
        _Enabled = false;
    }
    
    static void _WriteImage(uint8_t srcBlock, uint32_t dstBlockIdx) {
        _SDCard::WriteImage(*_RCA, srcBlock, dstBlockIdx);
        _ImgRingBufIncrement();
    }
    
    static void _SetPowerEnabled(bool en) {
        // Short-circuit if the pin state hasn't changed, to save us the Sleep()
        if (_Pin::VDD_B_SD_EN::Read() == en) return;
        
        _Pin::VDD_B_SD_EN::Write(en);
        // The TPS22919 takes 1ms for VDD to reach 2.8V (empirically measured)
        _Scheduler::Sleep(_Scheduler::Ms(2));
    }
    
    // _StateInit(): resets the _State.sd struct
    static void _StateInit(const SD::CardId& cardId, const SD::CardData& cardData) {
        FRAMWriteEn writeEn; // Enable FRAM writing
        
        // Mark the _State as invalid in case we lose power in the middle of modifying it
        _State.sd.valid = false;
        std::atomic_signal_fence(std::memory_order_seq_cst);
        
        // Set .cardId
        {
            _State.sd.cardId = cardId;
        }
        
        // Set .imgCap
        {
            // cardBlockCap: the capacity of the SD card in SD blocks (1 block == 512 bytes)
            const uint32_t cardBlockCap = ((uint32_t)GetBits<69,48>(cardData)+1) * (uint32_t)1024;
            // cardImgCap: the capacity of the SD card in number of images
            const uint32_t cardImgCap = cardBlockCap / ImgSD::ImgBlockCount;
            
            _State.sd.imgCap = cardImgCap;
        }
        
        // Set .imgRingBufs
        {
            _State.sd.imgRingBufs[0] = {};
            _State.sd.imgRingBufs[1] = {};
        }
        
        std::atomic_signal_fence(std::memory_order_seq_cst);
        _State.sd.valid = true;
    }
    
    // _ImgRingBufInit(): find the correct image ring buffer (the one with the greatest id that's valid)
    // and copy it into the other slot so that there are two copies. If neither slot contains a valid ring
    // buffer, reset them both so that they're both empty (and valid).
    static void _ImgRingBufInit() {
        using namespace MSP;
        FRAMWriteEn writeEn; // Enable FRAM writing
        
        MSP::ImgRingBuf& a = _State.sd.imgRingBufs[0];
        MSP::ImgRingBuf& b = _State.sd.imgRingBufs[1];
        const std::optional<int> comp = ImgRingBuf::Compare(a, b);
        if (comp && *comp>0) {
            // a>b (a is newer), so set b=a
            b = a;
        
        } else if (comp && *comp<0) {
            // b>a (b is newer), so set a=b
            a = b;
        
        } else if (!comp) {
            // Both a and b are invalid; reset them both
            a = {};
            b = {};
        }
    }
    
    static void _ImgRingBufIncrement() {
        FRAMWriteEn writeEn; // Enable FRAM writing
        MSP::ImgRingBuf ringBufCopy = _State.sd.imgRingBufs[0];
        
        // Update write index
        ringBufCopy.buf.widx++;
        // Wrap widx
        if (ringBufCopy.buf.widx >= _State.sd.imgCap) ringBufCopy.buf.widx = 0;
        
        // Update read index (if we're currently full)
        if (ringBufCopy.buf.full) {
            ringBufCopy.buf.ridx++;
            // Wrap ridx
            if (ringBufCopy.buf.ridx >= _State.sd.imgCap) ringBufCopy.buf.ridx = 0;
            
            // Update the beginning image id (which only gets incremented if we're full)
            ringBufCopy.buf.idBegin++;
        }
        
        // Update the end image id (the next image id that'll be used)
        ringBufCopy.buf.idEnd++;
        
        if (ringBufCopy.buf.widx == ringBufCopy.buf.ridx) ringBufCopy.buf.full = true;
        
        _State.sd.imgRingBufs[0] = ringBufCopy;
        _State.sd.imgRingBufs[1] = ringBufCopy;
    }
    
    // _RCA: SD card 'relative card address'; needed for SD comms after initialization.
    // As an optional, _RCA also signifies whether we've successfully initiated comms
    // with the SD card since the battery was plugged in.
    // Stored in BAKMEM (RAM that's retained in LPM3.5) so that
    // it's maintained during sleep, but reset upon a cold start.
    [[gnu::section(".ram_backup.main")]]
    static inline std::optional<uint16_t> _RCA;
    
    static inline bool _Enabled = false;
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
